app/views/ward_values/index.html.erb

    <td><%= ward_value.ward %></td>
    <td><%= ward_value.value %></td>
---
SELECT "ward_values".* FROM "ward_values"