app/views/streets/_form.html.erb

SELECT "wards".* FROM "wards"
---
    <%= f.label :ward %><br />
    <%= f.collection_select :ward_id, Ward.all, :id, :name %>