app/views/doodles/_form.html.erb

    <%= f.label :street %><br />
    <%= f.collection_select :street_id , Street.all, :id, :name %>
---
SELECT "streets".* FROM "streets"