app/views/doodles/index.html.erb


	$('.graffiti_item').mouseenter(function() {
		$(this).find('.graffiti_street, .vote_buttons').fadeIn(300);
	}).mouseleave(function() {
		$(this).find('.graffiti_street, .vote_buttons').fadeOut(300);
	});
---
SELECT "streets".* FROM "streets" WHERE "streets"."id" = 1 LIMIT 1