app/controllers/doodles_controller.rb

SELECT "doodles".* FROM "doodles" ORDER BY created_at DESC
---
  def index
    @doodles = Doodle.order('created_at DESC')

SELECT "doodles".* FROM "doodles" WHERE "doodles"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @doodle = Doodle.find(params[:id])

INSERT INTO "doodles" ("created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "latitude", "longitude", "street_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @doodle = Doodle.new(params[:doodle])

    respond_to do |format|
      if @doodle.save