app/controllers/pydwgns_controller.rb

  def index
    @pydwgns = Pydwgn.all
---
SELECT "pydwgns".* FROM "pydwgns"