app/controllers/street_values_controller.rb

SELECT "street_values".* FROM "street_values"
---
  def index
    @street_values = StreetValue.all