app/controllers/ward_values_controller.rb

SELECT "ward_values".* FROM "ward_values"
---
  def index
    @ward_values = WardValue.all