app/controllers/wards_controller.rb

  def index
    @wards = Ward.all
---
SELECT "wards".* FROM "wards"

  def map
    @wards = Ward.all
---
SELECT "wards".* FROM "wards"

  def show
    @ward = Ward.find(params[:id])
---
SELECT "wards".* FROM "wards" WHERE "wards"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @ward = Ward.find(params[:id])
---
SELECT "wards".* FROM "wards" WHERE "wards"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
    @ward = Ward.find(params[:id])

    respond_to do |format|
      if @ward.update_attributes(params[:ward])
---
SELECT "wards".* FROM "wards" WHERE "wards"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "wards" SET "name" = 'Craigentiny Dunningston', "updated_at" = '2013-02-21 23:19:49.493645' WHERE "wards"."id" = 1