app/views/votes/_form.html.erb

    <%= f.label :doodle %><br />
    <%= f.collection_select :doodle_id, Doodle.all, :id, :id %>
---
SELECT "doodles".* FROM "doodles"